In [1]:
# Consider the following series

# ser = pd.Series(np.random.randint(1, 10, 7))

# find the positions of numbers that are multiples of 3 from a series?

In [12]:
import pandas as pd
import numpy as np

In [21]:
ser = pd.Series(np.random.randint(1, 10, 7))
print("Original Series:")
print(ser)
result = np.where(ser % 3==0)
print("Positions of numbers that are multiples of 3:")
print(result)

Original Series:
0    1
1    4
2    4
3    5
4    6
5    1
6    6
dtype: int64
Positions of numbers that are multiples of 3:
(array([4, 6]),)

In [ ]:
# Create the series of 100 random numbers and extract the element at the even position.

In [24]:
ser = pd.Series(np.random.randint(1,100,100))

In [29]:
print("Original Series:")
print(ser)
li = []
count = 0
for i in ser:
    if count % 2 == 0:
        li.append(i)
    count += 1
print(li)

Original Series:
0     31
1     83
2     33
3     44
4     52
      ..
95    89
96    86
97    93
98    74
99    97
Length: 100, dtype: int64
[31, 33, 52, 99, 62, 9, 23, 25, 47, 11, 38, 1, 82, 87, 54, 28, 65, 45, 5, 72, 66, 81, 65, 83, 41, 40, 63, 12, 26, 39, 17, 30, 56, 74, 20, 26, 96, 98, 41, 17, 22, 59, 15, 99, 91, 24, 58, 33, 86, 74]

In [ ]:
# Convert the first character of each element in a series to uppercase

In [30]:
series = pd.Series(['hello', 'python', 'world',
                    'pandas', 'series'])
print("Series:")
series

Series:

0     hello
1    python
2     world
3    pandas
4    series
dtype: object

In [33]:
newSeries = series.map(lambda x: x[0].upper() + x[1::])
print("\nResulting Series :")
newSeries

Resulting Series :

0     Hello
1    Python
2     World
3    Pandas
4    Series
dtype: object

In [ ]:
# Complete the Euclidean distance between two series
# p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
# q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [34]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
p1 = np.sum([(a * a) for a in p])
p2 = np.sum([(b * b) for b in q])
p3 = -1 * np.sum([(2 * a*b) for (a, b) in zip(p, q)])
dist = np.sqrt(np.sum(p1 + p2 + p3))
  
print("Series 1:", p)
print("Series 2:", q)
print("Euclidean distance between two series is:", dist)

Series 1: 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
Series 2: 0    10
1     9
2     8
3     7
4     6
5     5
6     4
7     3
8     2
9     1
dtype: int64
Euclidean distance between two series is: 18.16590212458495

In [ ]:
# 5. Apply the label encoding to replace the string the given dataframe.
# Marks1	Marks2	Grade	Result
# 10	50	B	PASS
# 20	60	C	FAIL
# 30	40	B	PASS
# 40	85	A	PASS
# 50	83	A	FAIL

In [35]:
data = pd.read_csv('test - Sheet1.csv')

In [36]:
data

   Marks1  Marks2 Grade Result
0      10      50     B   PASS
1      20      60     C   FAIL
2      30      40     B   PASS
3      40      85     A   PASS
4      50      83     A   FAIL

In [41]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()
data['Grade']= label_encoder.fit_transform(data['Grade'])
data['Result']= label_encoder.fit_transform(data['Result'])
data

   Marks1  Marks2  Grade  Result
0      10      50      1       1
1      20      60      2       0
2      30      40      1       1
3      40      85      0       1
4      50      83      0       0

In [ ]:
# Create the 3 DataFrames based on the following raw data
# raw_data_1 = {
#         'subject_id': ['1', '2', '3', '4', '5'],
#         'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
#         'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

# raw_data_2 = {
#         'subject_id': ['4', '5', '6', '7', '8'],
#         'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
#         'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

# raw_data_3 = {
#         'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
#         'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

# Perform the following operation in a separate cell.
# Step 1. Assign each to a variable called data1, data2, data3
 
# Step 2. Join the two dataframes along rows and assign all_data
 
# Step 3. Join the two dataframes along columns and assing to all_data_col
 
# Step 4. Print data3
 
# Step 5. Merge all_data and data3 along the subject_id value
 
# Step 6. Merge only the data that has the same 'subject_id' on both data1 and data2
 
# Step 7. Merge all values in data1 and data2, with matching records from both sides where available.

In [47]:
raw_data_1 = {
         'subject_id': ['1', '2', '3', '4', '5'],
         'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
raw_data_2 = {
         'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
         'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
}
data1 = pd.DataFrame(raw_data_1)
data2 = pd.DataFrame(raw_data_2)
data3 = pd.DataFrame(raw_data_3)

In [48]:
data1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [49]:
data2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [50]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [64]:
all_data = pd.concat([data1, data2])

In [65]:
all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [66]:
all_data_col = pd.concat([data1, data2], axis = 1)
all_data_col

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [68]:
df = pd.merge(all_data, data3, on="subject_id")
df

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [69]:
df2 = pd.merge(data1, data2, on="subject_id")
df2

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

In [70]:
df3 = pd.merge(data1,data2, on='subject_id', how='outer')
df3

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan